// this 사용 예시

let 호텔 = [
  {
    '이름': '하나호텔1',
    '방의개수': 50,
    '예약자수' : 25,
    '남은방개수': function(){return this.방의개수 - this.예약자수}
  }, {
    '이름': '하나호텔2',
    '방의개수': 40,
    '예약자수' : 25,
    '남은방개수': function(){return this.방의개수 - this.예약자수}
  }, {
    '이름': '하나호텔3',
    '방의개수': 30,
    '예약자수' : 25,
    '남은방개수': function(){return this.방의개수 - this.예약자수}
  }, {
    '이름': '하나호텔4',
    '방의개수': 25,
    '예약자수' : 25,
    '남은방개수': function(){return this.방의개수 - this.예약자수}
  }
]

// 남은 방의 개수
호텔[0]['방의개수'] - 호텔[0]['예약자수']  // 25

// this를 활용하여 개수 확인
호텔[0].남은방개수()  // 25
호텔[0]['남은방개수']()  // 25





